export const testCategories = [
  { title: 'Карьера 💼', name: 'career' },
  { title: 'Семья 👨‍👩‍👧‍👦', name: 'family' },
  { title: 'Друзья 👫', name: 'friends' },
  { title: 'Здоровье 🏋️‍♂️', name: 'health' },
  { title: 'Хобби 🎨', name: 'hobby' },
  { title: 'Деньги 💰', name: 'money' },
  { title: 'Отдых 🌴', name: 'vacation' },
  { title: 'Саморазвитие 📚', name: 'selfdev' },
]

export const testAsks = {
  career: [
    'Насколько вы удовлетворены своей текущей работой или бизнесом? 🤔',
    'Насколько ваша деятельность соответствует вашим целям и ценностям? 🎯',
    'Чувствуете ли вы, что профессионально развиваетесь и движетесь вперед? 📈',
  ],
  family: [
    'Насколько гармоничны ваши отношения с ближайшими родственниками? ❤️',
    'Чувствуете ли вы поддержку и тепло в семейном кругу? 🤗',
    'Достаточно ли времени и внимания вы уделяете семье? ⏳',
  ],
  friends: [
    'Насколько вы удовлетворены своим кругом общения? 😊',
    'Есть ли у вас люди, с которыми можно поделиться радостью и трудностями? 💬',
    'Насколько вы чувствуете себя частью сообщества или группы единомышленников? 🏡',
  ],
  health: [
    'Насколько вы довольны своим физическим состоянием и уровнем энергии? ⚡',
    'Следите ли вы за питанием, сном и физической активностью? 🥗',
    'Часто ли у вас бывают проблемы со здоровьем, которые мешают жить полноценно? 🚑',
  ],
  hobby: [
    'Есть ли у вас увлечение, которое приносит радость и удовольствие? 🎸',
    'Достаточно ли времени вы уделяете своим хобби? ⏰',
    'Насколько ваше хобби помогает вам расслабляться и переключаться от рутины? 🧘‍♂️',
  ],
  money: [
    'Насколько вы довольны своим уровнем дохода? 💵',
    'Чувствуете ли вы финансовую стабильность и безопасность? 🏦',
    'Насколько уверенно вы смотрите в финансовое будущее? 📊',
  ],
  vacation: [
    'Достаточно ли у вас времени для отдыха и восстановления сил? 🏖',
    'Умеете ли вы качественно отдыхать, не думая о работе и проблемах? 🍹',
    'Довольны ли вы своим количеством путешествий или сменой обстановки? ✈️',
  ],
  selfdev: [
    'Чувствуете ли вы, что растете интеллектуально и личностно? 🧠',
    'Достаточно ли вы учитесь новому и развиваете полезные навыки? 🎓',
    'Насколько вы довольны своей дисциплиной и стремлением к новым достижениям? 🏆',
  ],
}
